In [44]:
import pandas as pd
import numpy as np
import pymysql as mysql
from sqlalchemy import create_engine

--------------------- LOADING DATA FROM DATASET ---------------------

In [45]:
requiredFields = ['CRASH_DATE', 'CRASH_TIME', 'PERSON_INJURY', 'BODILY_INJURY', 'PERSON_AGE', 'PERSON_SEX', 'PERSON_TYPE', 'PED_LOCATION']

In [46]:
# Reading data set to start with data wrangling
nyc_start_dataset = pd.read_csv('./NYC_Motor_Vehicle_Collisions_to_Person.csv', usecols=requiredFields)

In [47]:
# Showing starting dataset
nyc_start_dataset = nyc_start_dataset.head(10)

In [48]:
nyc_start_dataset.dtypes

CRASH_DATE        object
CRASH_TIME        object
PERSON_INJURY     object
PERSON_AGE       float64
BODILY_INJURY     object
PERSON_SEX        object
PERSON_TYPE       object
PED_LOCATION      object
dtype: object

--------------------- END LOADING DATA FROM DATASET ---------------------

--------------------- DATAWRANGLING ---------------------

In [49]:
# Replace all Nan values with stablished data
nyc_start_dataset['CRASH_DATE'] = nyc_start_dataset['CRASH_DATE'].fillna('2021-01-01');
nyc_start_dataset['CRASH_TIME'] = nyc_start_dataset['CRASH_TIME'].fillna('00:00');
nyc_start_dataset['PERSON_INJURY'] = nyc_start_dataset['PERSON_INJURY'].fillna('None');
nyc_start_dataset['PERSON_AGE'] = nyc_start_dataset['PERSON_AGE'].fillna(0);
nyc_start_dataset['PERSON_SEX'] = nyc_start_dataset['PERSON_SEX'].fillna('U');
nyc_start_dataset['PERSON_TYPE'] = nyc_start_dataset['PERSON_TYPE'].fillna('Unknown');
nyc_start_dataset['BODILY_INJURY'] = nyc_start_dataset['BODILY_INJURY'].fillna('Does Not Apply');
nyc_start_dataset['PED_LOCATION'] = nyc_start_dataset['PED_LOCATION'].fillna('Not Pedestrian');

In [50]:
# Clean ages on negative ages
nyc_start_dataset['PERSON_AGE'][nyc_start_dataset['PERSON_AGE'] < 0] = 0;
# Clean the last logical age being 121 
nyc_start_dataset['PERSON_AGE'][nyc_start_dataset['PERSON_AGE'] > 121] = 121;

<ipython-input-50-5a5e3ae1d798>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  nyc_start_dataset['PERSON_AGE'][nyc_start_dataset['PERSON_AGE'] < 0] = 0;
<ipython-input-50-5a5e3ae1d798>:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  nyc_start_dataset['PERSON_AGE'][nyc_start_dataset['PERSON_AGE'] > 121] = 121;

In [51]:
# Clean all sex
nyc_start_dataset[(nyc_start_dataset['PERSON_SEX'] != 'M') & (nyc_start_dataset['PERSON_SEX'] != 'F') & (nyc_start_dataset['PERSON_SEX'] != 'U')]

Empty DataFrame
Columns: [CRASH_DATE, CRASH_TIME, PERSON_INJURY, PERSON_AGE, BODILY_INJURY, PERSON_SEX, PERSON_TYPE, PED_LOCATION]
Index: []

In [52]:
dim_sex = pd.DataFrame({
  'sex': nyc_start_dataset['PERSON_SEX'].drop_duplicates().reset_index(drop=True),
  'binary': (np.where(nyc_start_dataset['PERSON_SEX'].drop_duplicates() == 'U', 0, 1))})
dim_sex.insert(0, 'id_sex', range(1, len(dim_sex) + 1))

In [53]:
dim_sex

   id_sex sex  binary
0       1   F       1
1       2   M       1

In [54]:
dim_ages = pd.DataFrame({
  'age': nyc_start_dataset['PERSON_AGE'].drop_duplicates().reset_index(drop=True)
})
dim_ages.insert(0, 'id_age', range(1, len(dim_ages) + 1))

In [55]:
dim_ages

   id_age   age
0       1  62.0
1       2  24.0
2       3  30.0
3       4  71.0
4       5  69.0
5       6  43.0
6       7  81.0
7       8  60.0
8       9  52.0
9      10  21.0

In [56]:
dim_date = nyc_start_dataset[['CRASH_DATE', 'CRASH_TIME']].groupby(['CRASH_DATE', 'CRASH_TIME']).size().reset_index()[['CRASH_DATE', 'CRASH_TIME']]
dim_date.columns = ['date', 'hour']
dim_date['date_hour'] = dim_date['date'] + ' ' + dim_date['hour']
dim_date.insert(0, 'id_date', range(1, len(dim_date) + 1))

In [57]:
dim_date

   id_date        date   hour         date_hour
0        1  2021-01-14  15:00  2021-01-14 15:00
1        2  2021-01-20  19:00  2021-01-20 19:00
2        3  2021-04-08  23:00  2021-04-08 23:00
3        4  2021-04-17  13:00  2021-04-17 13:00
4        5  2021-05-02  21:00  2021-05-02 21:00
5        6  2021-05-03  23:00  2021-05-03 23:00
6        7  2021-05-21   0:00   2021-05-21 0:00
7        8  2021-05-25  22:00  2021-05-25 22:00
8        9  2021-09-04  14:00  2021-09-04 14:00
9       10  2021-10-15   2:00   2021-10-15 2:00

In [58]:
dim_injuries = nyc_start_dataset[['PERSON_INJURY', 'BODILY_INJURY']].groupby(['PERSON_INJURY', 'BODILY_INJURY']).size().reset_index()[['PERSON_INJURY', 'BODILY_INJURY']]
dim_injuries.columns = ['person_injury', 'bodily_injury']
dim_injuries.insert(0, 'id_injury', range(1, len(dim_injuries) + 1))

In [59]:
dim_injuries

   id_injury person_injury bodily_injury
0          1        Killed         Chest
1          2        Killed   Entire Body
2          3        Killed          Head

In [60]:
dim_person_type = nyc_start_dataset[['PERSON_TYPE', 'PED_LOCATION']].groupby(['PERSON_TYPE', 'PED_LOCATION']).size().reset_index()[['PERSON_TYPE', 'PED_LOCATION']]
dim_person_type.columns = ['type', 'location']
dim_person_type.insert(0, 'id_person_type', range(1, len(dim_person_type) + 1))

In [61]:
dim_person_type

,id_person_type,type,location
0,1,Occupant,Not Pedestrian
1,2,Pedestrian,Pedestrian/Bicyclist/Other Pedestrian Not at I...
2,3,Pedestrian,Pedestrian/Bicyclist/Other Pedestrian at Inter...

In [62]:
fact_accidents = pd.DataFrame({
  'id_accident': range(1, len(nyc_start_dataset) + 1),
  'id_ages': nyc_start_dataset.join(dim_ages.set_index('age'), on=(['PERSON_AGE']))['id_age'],
  'id_sex': nyc_start_dataset.join(dim_sex.set_index('sex'), on=(['PERSON_SEX']))['id_sex'],
})

In [63]:
fact_accidents

   id_accident  id_ages  id_sex
0            1        1       1
1            2        2       2
2            3        3       2
3            4        4       2
4            5        5       1
5            6        6       2
6            7        7       2
7            8        8       2
8            9        9       2
9           10       10       2

--------------------- END DATAWRANGLING ---------------------

--------------------- DATAMART ---------------------

In [64]:
try: connection = mysql.connect(host='localhost', user='root', password='nintendo123'); print ('Succesfully connected to MySQL Server')
except: print ('Cannot connect to MySQL Server')

Succesfully connected to MySQL Server

In [65]:
# Creates new cursor from MySQL connection
cur = connection.cursor()
# Drops database to fill new data
try:
  cur.execute("DROP DATABASE IF EXISTS dm_datamart")
  cur.execute("CREATE DATABASE dm_datamart")
  connection.commit()
except:
  print ("Query Error")
cur.close()

In [ ]:
# Creates engine for database "dm_datamart"
engine = create_engine('mysql+pymysql://root:nintendo123@localhost/dm_datamart')

In [ ]:
dim_ages.to_sql('dim_ages', engine, if_exists='replace', index=False)

In [ ]:
dim_sex.to_sql('dim_sex', engine, if_exists='replace', index=False)

In [ ]:
dim_date.to_sql('dim_date', engine, if_exists='replace', index=False)

In [ ]:
dim_injuries.to_sql('dim_injuries', engine, if_exists='replace', index=False)

In [ ]:
dim_person_type.to_sql('dim_person_type', engine, if_exists='replace', index=False)

In [ ]:
fact_accidents.to_sql('fact_accidents', engine, if_exists='replace', index=False)

In [ ]:
nyc_start_dataset.to_sql('fact_temp_table', engine, if_exists='replace', index=False)

In [ ]:
sqlQuery = 'SELECT da.id_age FROM dm_datamart.dim_ages da INNER JOIN dm_datamart.fact_temp_table ftt ON ftt.PERSON_AGE = da.age;'
dimAge = pd.read_sql_query(sqlQuery, connection)

In [ ]:
sqlQuery = 'SELECT dd.id_date FROM dm_datamart.dim_date dd INNER JOIN dm_datamart.fact_temp_table ftt ON ftt.CRASH_DATE = dd.date AND ftt.CRASH_TIME = dd.hour;'
dimDate = pd.read_sql_query(sqlQuery, connection)

In [ ]:
sqlQuery = 'SELECT di.id_injury FROM dm_datamart.dim_injuries di INNER JOIN dm_datamart.fact_temp_table ftt ON ftt.PERSON_INJURY = di.person_injury AND ftt.BODILY_INJURY = di.bodily_injury;'
dimInjury = pd.read_sql_query(sqlQuery, connection)

In [ ]:
sqlQuery = 'SELECT dpt.id_person_type FROM dm_datamart.dim_person_type dpt INNER JOIN dm_datamart.fact_temp_table ftt ON ftt.PERSON_TYPE = dpt.type AND ftt.PED_LOCATION = dpt.location;'
dimPersonType = pd.read_sql_query(sqlQuery, connection)

In [ ]:
sqlQuery = 'SELECT ds.id_sex FROM dm_datamart.dim_sex ds INNER JOIN dm_datamart.fact_temp_table ftt ON ftt.PERSON_SEX = ds.sex;'
dimSex = pd.read_sql_query(sqlQuery, connection)

In [ ]:
fact_accidents = pd.DataFrame({
  'id_accident': range(1, len(nyc_start_dataset) + 1),
  'id_age': dimAge['id_age'],
  'id_date': dimDate['id_date'],
  'id_injury': dimInjury['id_injury'],
  'id_person_type': dimPersonType['id_person_type'],
  'id_sex': dimSex['id_sex'],
})

In [ ]:
fact_accidents

In [ ]:
fact_accidents.to_sql('fact_accidents', engine, if_exists='replace', index=False)

In [ ]:
cur = connection.cursor()
try:
  cur.execute("DROP TABLE IF EXISTS dm_datamart.fact_accidents")
  connection.commit()
except:
  print ("Query Error")
cur.close()

--------------------- DATAMART ---------------------